#+title: donkeycar


Collection of tools to communicate with donkeycar using ROS1 and use Marvelmind's beacons
* Structure
#+begin_src bash :results output :exports results
tree -d -L 1 --noreport
#+end_src

#+RESULTS:
: .
: └── docker


* Creating an image

#+begin_src bash
docker build -f Dockerfile.dev . -t ros-noetic-container-dev
#+end_src

* Raspberry PI
- Installed Buster version
- Added SSH file to use ssh
  ran =ssh-copy-id donkey@donkey.local=
- installed OLED Display service
  git clone https://github.com/accacio/pi-display
* Installed
#+begin_src bash
ros-base
#+end_src
